src/Catalogs/ШаблоныРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныРассылок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРассылок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыРассылок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ШаблоныРассылок/Forms/ФормаЭлемента/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Обновляет заголовок элемента формы "НадписьДлина"
//
Процедура ОбновитьНадписьДлина()
	
	Текст = ЭлементыФормы.Шаблон.Значение;
	
	Если ЕстьИдентификаторы(Текст) Тогда
		ЭлементыФормы.НадписьДлина.Заголовок = "Мин. длина сообщения: " + Строка(ДлинаБезИдентификаторов(Текст));
	Иначе
		ЭлементыФормы.НадписьДлина.Заголовок = "Длина сообщения: " + Строка(СтрДлина(Текст));		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПередОткрытием формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		ВидРассылки = Перечисления.ВидыРассылок.СМС;
	КонецЕсли;
	
	СписокИД = "%клиент%";	
	ОбновитьНадписьДлина();
	ОбновитьГиперссылкуРодительСправочника(ЭтаФорма);
	
КонецПроцедуры

// Обработчик события ОбработкаВыбора формы.
//
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	
	ВыборРодителя(ЭтотОбъект, ЭтаФорма, ЗначениеВыбора);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ГиперссылкаРодительНажатие(Элемент)
	
	НажатиеГиперссылкиРодительСправочника(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	ЭлементыФормы.Шаблон.Значение = ЭлементыФормы.Шаблон.Значение + СписокИД;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕКСТ ОСНОВНОЙ ПРОГРАММЫ

ПодключитьОбработчикОжидания("ОбновитьНадписьДлина", 1);
